reworked README.md
